'use strict';
console.log('JavaScript is awesome'.toUpperCase());
// console.log(typeof 44.6);
// alert('hello!');
///////////////////////////////////////////////
// const messege = 'do you want enter number?';
// const isAgree = confirm(messege);
// if (isAgree === true) {
//   const enteredNumber = prompt('Enter Number');
//   console.log('you entered:', typeof enteredNumber);
//   console.log('you entered:', typeof Number(enteredNumber));
// } else {
//   console.log('no number was entered');
// }
/////////////////////////////////////////////////////
// console.log(0.1 + 0.2);
// ## Задача 1 - Базовые математические операторы

// Выведи на экран общее количество яблок и винограда. Разницу яблок и винограда.

// const apples = 47;
// const grapes = 135;
// const total = apples + grapes;
// console.log(total);
// const diff = apples - grapes;
// console.log(diff);
//////////////////////////////////////////////////////////////
// ## Задача 2 - Комбинированные операторы

// Замени выражение переопределения комбинированным оператором `+=`.

// let students = 100;
// students += 50;
// console.log(students);
//////////////////////////////////////////////////////////////

// ## Задача 3 - Форматирование ссылки (endsWith)

// Напиши скрипт который проверяет заканчивается ли значение переменной `link`
// символом `/`. Если нет, добавь в конец значения `link` этот символ. Используй
// конструкцию `if...else`.

// let link = 'https://my-site.com/about';
// // Пиши код ниже этой строки
// if (link.endsWith('/')) {
//   console.log('Символ есть');
// } else {
//   link = link + '/';
// }
// // Пиши код выше этой строки
// console.log(link);
////////////////////////////////////////////////////////////////
// ## Задача 4 - Форматирование ссылки (includes и логическое «И»)

// Напиши скрипт который проверяет заканчивается ли значение переменной `link`
// символом `/`. Если нет, добавь в конец значения `link` этот символ, но только в
// том случае, если в `link` есть подстрока `"my-site"`. Используй конструкцию
// `if...else`.

// ```js
// let link = 'https://my-site.com/about';
// // Пиши код ниже этой строки
// if (link.includes('my-site')) {
//   if (link.endsWith('/')) {
//     console.log('Символ есть');
//   } else {
//     link = link + '/';
//   }
// }
// // Пиши код выше этой строки
// console.log(link);
///////////////////////////////////////////////////////////////////
// ## Задача 5 - Форматирование ссылки (тернарный оператор)

// // Выполни рефакторинг кода задачи номер 4 используя тернарный оператор.

// // ```js
// let link = 'https://my-site.com/about';
// if (link.includes('my-site') && !link.endsWith('/')) {
//   link += '/';
// }
// console.log(link);
//////////////////////////////////////////////////////////////////////
// ## Задача 6 - if...else и логические операторы

// Напиши скрипт которые будет выводить в консоль браузера строку в зависимости от
// значения переменной `hours`.

// Если значение переменной `hours`:

// - меньше `17`, выводи строку `"Pending"`
// - больше либо равно `17` и меньше либо равно 24, выводи строку `"Expires"`
// - больше `24` , выводи строку `"Overdue"`

// ```js
// const hours = 25;
// if (hours < 17) {
//   console.log('Pending');
// } else if (hours >= 17 && hours <= 24) {
//   console.log('Expires');
// } else {
//   console.log('Overdue');
// }
//////////////////////////////////////////////////////////////////////////////
// ## Задача 7 - Дедлайн сдачи проекта (if...else)

// Напиши скрипт для отображения времени дедлайна сдачи проекта. Используй
// конструкцию `if...else`.

// - Eсли до дедлайна 0 дней - выведи строку `"Сегодня"`
// - Eсли до дедлайна 1 день - выведи строку `"Завтра"`
// - Eсли до дедлайна 2 дня - выведи строку `"Послезавтра"`
// - Eсли до дедлайна 3+ дней - выведи строку `"Дата в будущем"`

// ```js
// const daysUntilDeadline = 1;
// // Пиши код ниже этой строки
// if (daysUntilDeadline === 0) {
//   console.log('Сегодня');
// } else if (daysUntilDeadline === 1) {
//   console.log('Завтра');
// } else if (daysUntilDeadline === 2) {
//   console.log('Послезавтра');
// } else {
//   console.log('Дата в будущем');
// }
/////////////////////////////////////////////////////////////////////////////////
// ## Задача 8 - Дедлайн сдачи проекта (switch)

// Выполни рефакторинг кода задачи номер 5 используя`switch`.

// const daysUntilDeadline = 10;
// switch (daysUntilDeadline) {
//   case 0:
//     console.log('Сегодня');
//     break;

//   case 1:
//     console.log('Завтра');
//     break;

//   case 2:
//     console.log('Послезавтра');
//     break;

//   default:
//     console.log('Дата в будущем');
// }
// ///////////////////////////////////////////////////////////////////////////////////
// ## Задача 9 - Цикл for

// // Напиши цикл for который выводит в консоль браузера числа по возрастанию от `min`
// // до `max`.

// // ```js
// const max = 100;
// const min = 20;

// for (let i = min; i <= max; i++) {
//   console.log(Number(i));
// }
// ////////////////////////////////////////////////////////////////////////////////////
// ## Задача 10 - Цикл for

// Напиши цикл for который выводит в консоль браузера числа по убыванию от `max` до
// `min`.

// // ```js
// const max = 100;
// const min = 20;
// for (let i = max; i >= min; i--) {
//   console.log(Number(i));
// }
/////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 11 - Цикл for

// При помощи цикла for выведи в консоль только чётные числа от `min` до `max`.

// // ```js
// const min = 3;
// const max = 15;
// for (let i = min; i <= max; i++) {
//   if (!(i % 2)) {
//     console.log(Number(i));
//   }
// }
/////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 12 - Ввод пользователя и ветвления

// Напиши скрипт, который будет спрашивать логин с помощью `prompt` и логировать
// результат в консоль браузера.

// - Если посетитель вводит `"Админ"`, то `prompt` запрашивает пароль
// - Если ничего не введено или нажата клавиша Esc - вывести строку `"Отменено"`
// - В противном случае вывести строку `"Я вас не знаю"`

// Пароль проверять так:

// - Если введён пароль `"Я админ"`, то вывести строку `"Здравствуйте!"`
// // - Иначе выводить строку `"Неверный пароль"`
// const userLogin = prompt('Enter login');
// console.log('entered login:', userLogin);
// if (userLogin === null) {
//   console.log('Отменено');
// } else if (userLogin === 'Админ') {
//   const userPassword = prompt('enter password');
//   if (userPassword === 'Я админ') {
//     console.log('Здравствуйте!');
//   } else {
//     console.log('Неверный пароль');
//   }
// } else {
//   console.log('Я вас не знаю');
// }
/////////////////////////////////////////////////////////////////////////////////
// # Задача 3 - Приоритет операторов

// // Разбери приоритет операторов в инструкции присвоения значения переменной
// // `result`.

// // ```js
// const result = 108 + 223 - 2 * 5;
// console.log(result);
///////////////////////////////////////////////////////////////////////////////////////
// ## Задача 4 - Класс Math

// Напиши скрипт, который выводит в консоль округленные вверх/вниз и т.д. значения
// переменной `value`. Используй методы `Math.floor()`, `Math.ceil()` и
// `Math.round()`. Проверь что будет в консоли при значениях `27.3` и `27.9`.

// // ```js
// const value = 27.5;
// console.log(Math.round(value));
// console.log(Math.floor(value));
// console.log(Math.ceil(value));
/////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 5 - Шаблонные строки

// Составь фразу с помощью шаблонных строк `A has B bots in stock`, где A, B -
// переменные вставленные в строку.

// // ```js
// const companyName = 'Cyberdyne Systems';
// const repairBots = 150;
// const defenceBots = 50;
// const message = `${companyName} has ${repairBots + defenceBots} bots in stock`;
// console.log(message); // "Cyberdyne Systems has 200 bots in stock"
/////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 8 - Значение по умолчанию и оператор нулевого слияния

// Отрефактори код так, чтобы в переменную `value` присваивалось значение
// переменной `incomingValue`, если оно не равно `undefined` или `null`. В
// противном случае должно присваиваться значение `defaultValue`. Проверь работу
// скрипта для слепдующих значений переменной `incomingValue`: null, undefined, 0,
// false. Используй оператор `??` (nullish coalescing operator).

// // ```js
// const incomingValue = undefined;
// const defaultValue = 11;
// let value = defaultValue;
// if (incomingValue) {
//   value = incomingValue;
// }
// // const value = incomingValue || defaultValue;
// console.log(value);
////////////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 9 - Опертор % и методы строк

// Напиши скрипт который переведёт значение `totalMinutes` (количество минут) в
// строку в формате часов и минут `HH:MM`.

// - 70 покажет 01:10
// - 450 покажет 07:30
// - 1441 покажет 24:01

// ```js
// function time(myminutes) {
//   const totalMinutes = myminutes;
//   const hours = Math.floor(totalMinutes / 60);
//   const minutes = totalMinutes % 60;

//   const doubleDigitHours = String(hours).padStart(2, 0);
//   const doubleDigitMinutes = String(minutes).padStart(2, 0);
//   console.log(`${doubleDigitHours}:${doubleDigitMinutes}`);
// }
// time(70);
// time(450);
// time(1441);
/////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 1 - Ввод пользователя и ветвления

// Используя конструкцию if..else и prompt, напиши код, который будет спрашивать:
// `"Какое официальное название JavaScript?"`. Если пользователь вводит
// `ECMAScript`, то показывай alert со строкой `"Верно!"`, в противном случае -
// `"Не знаете? ECMAScript!"`
// const inputText = prompt('Какое официальное название JavaScript?');
// if (inputText === 'ECMAScript') {
//   alert('Верно!');
// } else {
//   alert('Не знаете? ECMAScript!');
// }
//////////////////////////////////////////////////////////////////////////////////////////////
// ## Задача 2 - Отображение времени (if...else)

// Напиши скрипт для отображения часов и минут в консоли браузера в виде строки
// // формата `"14 ч. 26 мин."`. Если значение переменной `minutes` равно `0`, то
// // выводи строку `"14 ч."`, без минут.

// // ```js
// const hours = 14;
// const minutes = 0;
// let timestring;
// if (minutes > 0) {
//   timestring = `${hours} ч. ${minutes} мин.`;
// } else {
//   timestring = `${hours} ч.`;
// }
// console.log(timestring);
/////////////////////////////////////////////////////////////////////////////////////////////////
